--ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½ÃƒÆ’Ã‚Â¯Ãƒâ€šÃ‚Â¿Ãƒâ€šÃ‚Â½
--os.setlocale ("ru_ru.KOI8-R")
print("��� ��� ������ ��������� �� 1251")
print("������ ���� ����� ����� ������ � SublimeText")
print(os.setlocale)
print(os.date())
--
--defines a factorial 
function fact (n) 
	if n == 0 then 
		return 1 
	else
		return n*fact(n-1)
	end 
end
print ("enter a number:") 
n = io.read () -- reads a number print(fact(a))
print(fact(n))

